import 'dart:ui';

import 'package:flutter/cupertino.dart';
import 'package:flutter/material.dart';
import 'package:flutter/widgets.dart';
import 'package:google_fonts/google_fonts.dart';
import 'package:search/khwater_details.dart';
import 'package:search/khwater_model.dart';

class DataTab extends StatelessWidget {
  DataTab({super.key});

  List<String> Khwater = [
    "العباده",
    "ماهو الموت",
    "ذكريات مع خطبة الجمعه",
    "حقيقة تأليه المسيح",
    "الفتن",
    "الطيور",
    "عيد الام",
    "النحل",
    "النفس التائهة",
    "القضاء والقدر",
    "الفول الجزء الاول",
    "الفول الجزء الثانى",
    "الحصة الأخيرة",
    "اپنتي المسافرة",
    "الاحلام والكوابيس",
    "الجمال في عين العاشق",
    "انت كم تساوي في سوق البضائع؟ ",
    "النعمه الجزء الاول",
    "النعمه الجزء الثانى",
    "النعمه الجزء الثالث",
    "فضفضة معلم لناظر الكوميديا",
    "ايام زمان",
    "افكار جديدة نحو تعليم افضل الجزء الاول ",
    "  رحلتي مع التربيه والتعليم الجزء الاول",
    "رحلتي مع التربيه والتعليم الجزء الثانى",
    "رحلتي مع التربيه والتعليم الجزء الثالث",
    " افكار جديدة نحوتعليم افضل الجزء الثانى",
    "نوادر غش الامتحانات الجزء الاول",
    "نوادر غش الامتحانات الجزء الثانى",
    "الدروس الخصوصيه",
    "الكائنات المضيئه",
    "اذا شردت احدي الأغنام .. فعليك بالراعي",
    "الجان وتحضير الارواح الجزء الاول",
    "الجان وتحضير الارواح الجزء الثانى",
    "الصلاة",
    "الي الشعب",
    "الشعرواى ",
    "هل تتذكر اسماء معلميك",
    "الخميرة الفوريه والعاديه",
    "الشاي والضغط",
    "السادات",
    "لماذا خلق الله الحشرات",
    "الزلازل",
    "الشاي بعد الاكل  خطأ",
    "الكابوس ليس نذير شؤم ",
    "ذكرياتي  فى التجنيد ",
    "انتشر الفساد حولنا",
    "راعي ام موجه",
    "الامتحان علي الابواب",
    "جميع بني البشر",
    "لماذا نخاف الموتي",
    "تعلمت منك ياصغيري",
    "اخي المعلم",
    "درسا خاصا",
    "رحلتي مع الدرس الخاص",
    "كتبت وصيتي في لجنة ابو كبير الثانويه",
    "قبل ان تذهب لجهنم غدا",
    "النبات واحساسه",
    "امرأة لم تتعلم فاقت المتعلمين",
    "محراب التربيه والتعليم",
    "الرجل اكثر حنانا من المراة",
    "الاستخدام الآمن للإنترنت",
    "معلومه علي العشاء ",
    "صاحبي هذا ومعلم هذا",
    "الصفه ولا نحب الموصوف",
    "اصلاح التعليم",
    "شرب الماء",
    "بكم تشتري هذه الابتسامه",
    "رحلتى مع الامتحانات",
    "براءة المتهم وحبس المحامي",
    "الحر الشديد نعمه من نعم الله",
    "الدواء",
    "المسبب و علاج السبب",
    "اخواننا في الخارج  وماكينات صرف النقود",
    "ثعبان ام فأر",
    "اتدرون ما الموت",
    " ذيادة المرتبات او عدم ذيادتها",
    "رحلتي التوجيه العام الجزء الاول",
    "رحلتي التوجيه العام الجزء الثانى",
    "رحلتي التوجيه العام الجزء الثالث",
    "رحلتي التوجيه العام الجزء الرابع",
    "الحمد لله كثيرا",
    "يوميات مدرس في الارياف الجزء الاول",
    "يوميات مدرس في الارياف الجزء الثانى",
    "يوميات مدرس في الارياف الجزء الثالث",
    "ياكل قواميس العالم ومعاجمه",
    "تحطيم القدوة الصحيحه واستبدالها بأخري",
    "خواطر معاش.",
    "ارتفع غطاء الاناء ",
    "سألني الطبيب عن مهنتي فترددت ",
    " مابعد الموت الجزء الاول",
    "مابعد الموت الجزء الثاني",
    "مابعد الموت الجزء الثالث",
    "تحضير الارواح",
    "الصف الاخير ",
    "عجائب وغرائب",
    "الاسلام الحق",
    "ذكريات خطوبة",
    "سرعتنا في احلامنا اسرع من الضوء",
  ];

  @override
  Widget build(BuildContext context) {
    return Column(
      mainAxisSize: MainAxisSize.min,
      children: [
        SizedBox(
          height: MediaQuery.of(context).size.height*.43,
            child: Image.asset(
                  "assets/images/pic1.png",
                  alignment: Alignment.center,
                ),),
        const Divider(
          thickness: 3,
          color: Color(0xFFB7935F),
        ),
        Text(
          "خواطر",
          style:
              GoogleFonts.elMessiri(fontSize: 25, fontWeight: FontWeight.w600),
        ),
        const Divider(
          thickness: 3,
          color: Color(0xFFB7935F),
        ),
        Expanded(
          child: ListView.separated(
            separatorBuilder: (context, index) => const Divider(
              indent: 50,
              endIndent: 50,
              thickness: 1,
              color: Color(0xFFB7935F),
            ),
            itemBuilder: (context, index) {
              return InkWell(
                onTap: () {
                  Navigator.pushNamed(context, KhwaterDetails.routeName,
                      arguments:
                          KhwaterModel(name: Khwater[index], index: index));
                },
                child: Text(
                  Khwater[index],
                  textAlign: TextAlign.center,
                  style: GoogleFonts.elMessiri(
                      fontSize: 27, fontWeight: FontWeight.w400),
                ),
              );
            },
            itemCount: Khwater.length,
          ),
        ),
      ],
    );
  }
}
